Testing
```
Silenios-MacBook-Pro:test-tf squarti$ terraform init

Initializing the backend...

Initializing provider plugins...
- Finding ibm-cloud/ibm versions matching "1.57.0"...
- Installing ibm-cloud/ibm v1.57.0...
- Installed ibm-cloud/ibm v1.57.0 (self-signed, key ID AAD3B791C49CC253)

Partner and community providers are signed by their developers.
If you'd like to know more about provider signing, you can read about it here:
https://www.terraform.io/docs/cli/plugins/signing.html

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - ibm-cloud/ibm in /Users/squarti/go/bin
│ 
│ Skip terraform init when using provider development overrides. It is not necessary and may error unexpectedly.
╵

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
Silenios-MacBook-Pro:test-tf squarti$ terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - ibm-cloud/ibm in /Users/squarti/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.ibm_resource_group.group: Reading...
data.ibm_resource_group.group: Read complete after 1s [id=eb922ba0717f47589ca26d202c5cc915]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # ibm_database.ssq_ic_test_terraform will be created
  + resource "ibm_database" "ssq_ic_test_terraform" {
      + adminuser               = (known after apply)
      + configuration_schema    = (known after apply)
      + connectionstrings       = (known after apply)
      + groups                  = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "us-east"
      + name                    = "ssq-ic2-terraform"
      + plan                    = "standard"
      + resource_controller_url = (known after apply)
      + resource_crn            = (known after apply)
      + resource_group_id       = "eb922ba0717f47589ca26d202c5cc915"
      + resource_group_name     = (known after apply)
      + resource_name           = (known after apply)
      + resource_status         = (known after apply)
      + service                 = "databases-for-redis"
      + service_endpoints       = "public"
      + status                  = (known after apply)
      + tags                    = (known after apply)
      + version                 = (known after apply)

      + group {
          + group_id = "member"

          + disk {
              + allocation_mb = 20480
            }

          + host_flavor {
              + id = "b3c.4x16.encrypted"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_database.ssq_ic_test_terraform: Creating...
ibm_database.ssq_ic_test_terraform: Still creating... [10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [20s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [30s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [40s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [50s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [1m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [1m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [1m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [1m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [1m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [1m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [2m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [2m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [2m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [2m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [2m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [2m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [3m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [3m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [3m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [3m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [3m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [3m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [4m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [4m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [4m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [4m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [4m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [4m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [5m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [5m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [5m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [5m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [5m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [5m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [6m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [6m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [6m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [6m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [6m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [6m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [7m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [7m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still creating... [7m20s elapsed]
ibm_database.ssq_ic_test_terraform: Creation complete after 7m22s [id=crn:v1:bluemix:public:databases-for-redis:us-east:a/40ddc34a953a8c02f10987b59085b60e:855644c3-b8bf-470d-8a51-30767629a706::]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
Silenios-MacBook-Pro:test-tf squarti$ terraform apply
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - ibm-cloud/ibm in /Users/squarti/go/bin
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
data.ibm_resource_group.group: Reading...
data.ibm_resource_group.group: Read complete after 2s [id=eb922ba0717f47589ca26d202c5cc915]
ibm_database.ssq_ic_test_terraform: Refreshing state... [id=crn:v1:bluemix:public:databases-for-redis:us-east:a/40ddc34a953a8c02f10987b59085b60e:855644c3-b8bf-470d-8a51-30767629a706::]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # ibm_database.ssq_ic_test_terraform will be updated in-place
  ~ resource "ibm_database" "ssq_ic_test_terraform" {
        id                      = "crn:v1:bluemix:public:databases-for-redis:us-east:a/40ddc34a953a8c02f10987b59085b60e:855644c3-b8bf-470d-8a51-30767629a706::"
        name                    = "ssq-ic2-terraform"
        tags                    = []
        # (17 unchanged attributes hidden)

      - group {
          - group_id = "member" -> null

          - disk {
              - allocation_mb = 20480 -> null
            }

          - host_flavor {
              - id = "b3c.4x16.encrypted" -> null
            }
        }
      + group {
          + group_id = "member"

          + disk {
              + allocation_mb = 20480
            }

          + host_flavor {
              + id = "b3c.8x32.encrypted"
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

ibm_database.ssq_ic_test_terraform: Modifying... [id=crn:v1:bluemix:public:databases-for-redis:us-east:a/40ddc34a953a8c02f10987b59085b60e:855644c3-b8bf-470d-8a51-30767629a706::]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 10s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 20s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 30s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 40s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 50s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 1m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 1m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 1m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 1m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 1m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 1m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 2m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 2m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 2m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 2m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 2m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 2m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 3m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 3m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 3m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 3m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 3m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 3m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 4m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 4m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 4m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 4m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 4m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 4m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 5m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 5m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 5m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 5m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 5m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 5m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 6m0s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 6m10s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 6m20s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 6m30s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 6m40s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 6m50s elapsed]
ibm_database.ssq_ic_test_terraform: Still modifying... [id=crn:v1:bluemix:public:databases-for-red...855644c3-b8bf-470d-8a51-30767629a706::, 7m0s elapsed]
ibm_database.ssq_ic_test_terraform: Modifications complete after 7m8s [id=crn:v1:bluemix:public:databases-for-redis:us-east:a/40ddc34a953a8c02f10987b59085b60e:855644c3-b8bf-470d-8a51-30767629a706::]

Apply complete! Resources: 0 added, 1 changed, 0 destroyed.
```